ConfigFiles/Enums/СрочностьИсправленияОшибок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СрочностьИсправленияОшибок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Немедленно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖелательноБыстрее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПлановомПорядке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/ВариантыИсправленияОшибок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыИсправленияОшибок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТолькоВВеткеОбнаружения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоВОсновнойВеткеПроекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРазныхВетках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезИзмененийВВетках</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/ТипыВеток.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыВеток</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяВеткаПроекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеткаВерсии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеткаТехническогоПроекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеткаДляИсправленияОшибок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Catalogs/ВерсииПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВерсииПроекта</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияМеханизмаОбновленияИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформыХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ветка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВключенияБиблиотек</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГотовностиКПредварительномуВстраиванию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВнешнегоТестирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРазработки</Name>
					<Comment>Начало разработки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияРазработки</Name>
					<Comment>Окончание разработки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПредстоящейСборки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрекращенияПоддержки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяИБДляЗагрузкиМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяХранилищаДляЗагрузкиМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогИБДляЗагрузкиМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПодредакции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРедакции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьКонфигурациюИзХранилищаПриЗагрузкеМетаданных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяИБДляЗагрузкиМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяХранилищаДляЗагрузкиМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубликуемыйНомерВерсии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьПатчи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВерсииВключаемыхПроектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВерсииПроекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтличияВИменахМетаданных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтличияВСоставеПодсистем</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подсистема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подсистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектНужноДобавитьВПодсистему</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Enums/СрочностьИсправленияОшибок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Проект = Неопределено;
	
	ОтборПоПроекту = Параметры.Свойство("Владелец", Проект);
	
	Если Не ОтборПоПроекту Тогда
		Возврат;
	КонецЕсли;
	
	СборкаОбнаружения = Неопределено;
	ВеткаОбнаружения  = Неопределено;
	Исправляется      = Неопределено;
	ДатаОбнаружения   = '00010101';
	
	ОтборПоСборке       = Параметры.Свойство("СборкаОбнаружения", СборкаОбнаружения);
	ОтборПоВетке        = Параметры.Свойство("ВеткаОбнаружения",  ВеткаОбнаружения);
	ОтборПоИсправляется = Параметры.Свойство("Исправляется",      Исправляется);
	
	Параметры.Свойство("ДатаОбнаружения", ДатаОбнаружения);
	
	Если Не ОтборПоСборке и Не ОтборПоВетке Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДатаОбнаруженияОшибки = '00010101';
		
	Если ЗначениеЗаполнено(СборкаОбнаружения) Тогда
		ДанныеСборкиОбнаружения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СборкаОбнаружения, "Владелец,Ветка,ДатаСборки");
		ВерсияОбнаружения     = ДанныеСборкиОбнаружения.Владелец;
		ВеткаОбнаружения      = ДанныеСборкиОбнаружения.Ветка;
		ДатаОбнаруженияОшибки = ДанныеСборкиОбнаружения.ДатаСборки;
	ИначеЕсли ЗначениеЗаполнено(ВеткаОбнаружения) Тогда
		ВерсияОбнаружения = Справочники.Ошибки.ВерсияОбнаруженияДляВетки(ВеткаОбнаружения,ДатаОбнаружения);
	Иначе
		ВерсияОбнаружения = Справочники.ВерсииПроекта.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаОбнаруженияОшибки) Тогда
		ДатаОбнаруженияОшибки = ДатаОбнаружения;
	КонецЕсли;
		
	ВерсияНемедленно = Неопределено;
	ВерсияЖелательноБыстрее = Неопределено;
	ВерсияВПлановомПорядке = Неопределено;
		
	ВерсияИсправленияРассчитываетсяПоНастройкамПроекта = Ложь;
	
	Если Исправляется = Перечисления.ВариантыИсправленияОшибок.ТолькоВВеткеОбнаружения Тогда
		
		ДанныеДляВеткиОбнаружения = Справочники.Ошибки.ДанныеДляВетки(ВеткаОбнаружения);
		
		ТипВеткиОбнаружения    = ДанныеДляВеткиОбнаружения.Тип;
		ПроектВеткиОбнаружения = ДанныеДляВеткиОбнаружения.Проект;
		ТипВеткиПриемника      = ДанныеДляВеткиОбнаружения.ТипПриемника;
		ВеткаПриемник          = ДанныеДляВеткиОбнаружения.Приемник;
		
		Если ТипВеткиОбнаружения = Перечисления.ТипыВеток.ОсновнаяВеткаПроекта Тогда
			// Если ветка- основная ветка проекта, то исправление планируется, исходя
			// из настроек проекта, с учетом срочности исправления.
			ВерсияИсправленияРассчитываетсяПоНастройкамПроекта = Истина;
		Иначе			
			
			ВерсияИсправления = Справочники.ВерсииПроекта.ПустаяСсылка();
			
			Если ТипВеткиОбнаружения = Перечисления.ТипыВеток.ВеткаВерсии Тогда
				// Если ветка - ветка версии, исправление именно в этой ветке
				ВерсияИсправления = ВерсияОбнаружения;
			ИначеЕсли ТипВеткиОбнаружения = Перечисления.ТипыВеток.ВеткаТехническогоПроекта Тогда
				// Если ветка- ветка технического проекта, исправление в версии технического проекта.
				ВерсияИсправления = Справочники.Ошибки.ВерсияОбнаруженияДляВеткиТехническогоПроекта(ВеткаОбнаружения, ДатаОбнаруженияОшибки);
			ИначеЕсли ТипВеткиОбнаружения = Перечисления.ТипыВеток.ВеткаДляИсправленияОшибок Тогда
				// Если ветка- ветка для исправленния ошибок - анализируется ветка-приемник.
				Если ТипВеткиПриемника = Перечисления.ТипыВеток.ВеткаВерсии Тогда
					//Если приемник- ветка версии, то исправление в версии-приемнике.
					ВерсияИсправления = Справочники.Ошибки.ВерсияОбнаруженияДляВеткиВерсии(ВеткаПриемник);
				ИначеЕсли ТипВеткиПриемника = Перечисления.ТипыВеток.ОсновнаяВеткаПроекта Тогда
					// Если приемник- основная ветка проекта, исправление планируется в текущей
					// версии, разрабатываемой в основной ветке.
					ВерсияИсправления = Справочники.Ошибки.ВерсияПоОсновнойВеткеПроекта(ПроектВеткиОбнаружения);
				КонецЕсли;
			КонецЕсли;
			
			ВерсияНемедленно        = ВерсияИсправления;
			ВерсияЖелательноБыстрее = ВерсияИсправления;
			ВерсияВПлановомПорядке  = ВерсияИсправления;
			
		КонецЕсли;
		
	Иначе
		ВерсияИсправленияРассчитываетсяПоНастройкамПроекта = Истина;
	КонецЕсли;
	
	Если ВерсияИсправленияРассчитываетсяПоНастройкамПроекта Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПроектыПорядокВоспроизведенияИИсправленияОшибок.ВерсияИсправленияНемедленно КАК ВерсияИсправленияНемедленно,
		|	ПроектыПорядокВоспроизведенияИИсправленияОшибок.ВерсияИсправленияЖелательноБыстрее КАК ВерсияИсправленияЖелательноБыстрее,
		|	ПроектыПорядокВоспроизведенияИИсправленияОшибок.ВерсияИсправленияВПлановомПорядке КАК ВерсияИсправленияВПлановомПорядке
		|ИЗ
		|	Справочник.Проекты.ПорядокВоспроизведенияИИсправленияОшибок КАК ПроектыПорядокВоспроизведенияИИсправленияОшибок
		|ГДЕ
		|	ПроектыПорядокВоспроизведенияИИсправленияОшибок.Ссылка = &Проект
		|	И (ПроектыПорядокВоспроизведенияИИсправленияОшибок.ВерсияВоспроизведения = &ВерсияОбнаружения
		|     ИЛИ ПроектыПорядокВоспроизведенияИИсправленияОшибок.ВерсияВоспроизведения = ЗНАЧЕНИЕ(Справочник.ВерсииПроекта.ПустаяСсылка))
		|	И (НЕ &ОтбиратьПоСтрокеПоиска
		|			ИЛИ ""Немедленно"" ПОДОБНО &СтрокаПоиска
		|			ИЛИ ""Желательно быстрее"" ПОДОБНО &СтрокаПоиска
		|			ИЛИ ""В плановом порядке"" ПОДОБНО &СтрокаПоиска)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПроектыПорядокВоспроизведенияИИсправленияОшибок.ВерсияВоспроизведения УБЫВ"
		;
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ВерсияОбнаружения", ВерсияОбнаружения);
		Запрос.УстановитьПараметр("Проект", Проект);
		
		СтрокаПоиска = Параметры.СтрокаПоиска;
		
		Если СтрокаПоиска <> Неопределено Тогда
			Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска + "%");
			Запрос.УстановитьПараметр("ОтбиратьПоСтрокеПоиска", Истина);
		Иначе
			Запрос.УстановитьПараметр("СтрокаПоиска", "");
			Запрос.УстановитьПараметр("ОтбиратьПоСтрокеПоиска", Ложь);
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Если Выборка.Следующий() Тогда
				
				Если ЗначениеЗаполнено(Выборка.ВерсияИсправленияНемедленно) Тогда
					ВерсияНемедленно = Выборка.ВерсияИсправленияНемедленно;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.ВерсияИсправленияЖелательноБыстрее) Тогда
					ВерсияЖелательноБыстрее = Выборка.ВерсияИсправленияЖелательноБыстрее;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.ВерсияИсправленияВПлановомПорядке) Тогда
					ВерсияВПлановомПорядке = Выборка.ВерсияИсправленияВПлановомПорядке;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	ДанныеВыбора = Новый СписокЗначений;
	
	Если ВерсияНемедленно = Неопределено
		И ВерсияЖелательноБыстрее = Неопределено
		И ВерсияВПлановомПорядке = Неопределено
		И СтрокаПоиска <> Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПредставлениеНемедленно = 
		ПредставлениеСрочности(Перечисления.СрочностьИсправленияОшибок.Немедленно, ВерсияНемедленно);
	
	ПредставлениеЖелательноБыстрее = 
		ПредставлениеСрочности(Перечисления.СрочностьИсправленияОшибок.ЖелательноБыстрее, ВерсияЖелательноБыстрее);
	
	ПредставлениеВПлановомПорядке = 
		ПредставлениеСрочности(Перечисления.СрочностьИсправленияОшибок.ВПлановомПорядке, ВерсияВПлановомПорядке);
	
	ДанныеВыбора.Добавить(Перечисления.СрочностьИсправленияОшибок.Немедленно, ПредставлениеНемедленно);
	ДанныеВыбора.Добавить(Перечисления.СрочностьИсправленияОшибок.ЖелательноБыстрее, ПредставлениеЖелательноБыстрее);
	ДанныеВыбора.Добавить(Перечисления.СрочностьИсправленияОшибок.ВПлановомПорядке, ПредставлениеВПлановомПорядке);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеСрочности(ЗначениеСрочности, Версия)

	Если ЗначениеЗаполнено(Версия) Тогда
		Представление = Строка(ЗначениеСрочности) + " (" + Версия +  ")";
	Иначе
		Представление = Строка(ЗначениеСрочности);
	КонецЕсли;
	
	Возврат Представление;
		
КонецФункции
	
#КонецОбласти

#КонецЕсли
